;;; ~/.doom.d/packages.el -*- no-byte-compile: t; -*-

(package! ascii-art-to-unicode)
(package! chess)
(package! cider-eval-sexp-fu)
(package! clipmon)
(package! dashboard)
(package! edit-server)
(package! esup)
(package! eval-sexp-fu)
(package! feature-mode)
(package! ghub)
(package! gptel)
(package! highlight-sexp)
(package! ialign)
(package! k8s-mode)
(package! kubernetes)
(package! magit-todos)
(package! magit-delta)
(package! mise)
(package! monkeytype)
(package! nov)
(package! password-generator)
(package! powershell)

(package! evil-snipe :disable t)
(package! flycheck-joker :disable t)
(package! org-superstar :disable t)

(when (featurep :system 'windows)
  (package! forge :disable t))
